[M_MonsterMash2 MissionDefinition]
MissionName="Beasts of Macedonia (Part 2))"
MissionDescription="Dr. Z promises to pay if they get him other parts of various animals, but you don't say what those parts are.."
TurnInDescription="Dr. You start to wonder if Zedd is involved in something dark and completely illegal.."
MissionSummary="Dr. maybe "
MissionGiver="Dr. the wall"
MissionTurnInLocation="Dr. bus"
TeaserText="Jed wants more animal parts!!"

[M_MonsterMash2:RakkParts MissionObjectiveDefinition]
ProgressMessage="Collect chess pieces from the chess board."

[M_MonsterMash2:RakkPartsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_MonsterMash2:SkagParts MissionObjectiveDefinition]
ProgressMessage="Take out the trash."

[M_MonsterMash2:SkagPartsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

